Revit 2024 API
MassSurfaceData.MaterialType Property
 material type of mass zone
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public MassSurfaceDataMaterialType MaterialType { get; set; }
Visual Basic
Public Property MaterialType As MassSurfaceDataMaterialType
	Get
	Set
Visual C++
public:
property MassSurfaceDataMaterialType MaterialType {
	MassSurfaceDataMaterialType get ();
	void set (MassSurfaceDataMaterialType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The material type does not fall within an appropriate range.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace